Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/УчастникиПрограммОбученияСУО/УчастникиПрограммОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиПрограммОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РуководителиСУО/РуководителиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РуководителиСУО</name>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРуководства</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      <types>CatalogRef.УчебныеГруппыСУО</types>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроведенияОбъектовСУО/СтатусыПроведенияОбъектовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроведенияОбъектовСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ПродолжительностьОбученияСУО/ПродолжительностьОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПродолжительностьОбученияСУО</name>
  <enumValues>
    <name>Фиксированная</name>
  </enumValues>
  <enumValues>
    <name>СНачалаОбучения</name>
  </enumValues>
  <enumValues>
    <name>СЗачисления</name>
  </enumValues>
  <enumValues>
    <name>НеЗадана</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеПрограммыОбученияСУО/ПрохождениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеПрограммыОбученияСУО</name>
  <registerRecords>InformationRegister.ПрохожденияПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиПрограммОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <comment>Учебная группа, в рамках которой пользователь проходит Проведение программы обучения.</comment>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/Documents/ПроведениеПреподавателемОбученияСУО/ПроведениеПреподавателемОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПреподавателемОбученияСУО</name>
  <registerRecords>InformationRegister.ПроведениеПреподавателямиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПреподавателейСУО</registerRecords>
  <registerRecords>InformationRegister.ПреподавателиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьОтУченика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоПросмотрВедомости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СодержаниеПрограммыОбученияСУО/СодержаниеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеПрограммыОбученияСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КаталогПрограммОбученияСУО</owners>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// УЧАСТНИКИ

// Возвращает участников программы обучения
// 
Функция Участники(ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчастникиПрограммОбученияСУО.Регистратор КАК Прохождение,
		|	УчастникиПрограммОбученияСУО.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.УчастникиПрограммОбученияСУО КАК УчастникиПрограммОбученияСУО
		|ГДЕ
		|	УчастникиПрограммОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ПрохожденияПрограммыОбучения(ПроведениеПрограммыОбучения, ЗначениеПометкаУдаления = Неопределено, МассивПользователей = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Прохождение,
		|	ПрохождениеПрограммыОбученияСУО.Пользователь,
		|	ПрохождениеПрограммыОбученияСУО.УчебнаяГруппа,
		|	ПрохождениеПрограммыОбученияСУО.Пользователь.Наименование КАК Наименование,
		|	ПрохождениеПрограммыОбученияСУО.Проведен
		|ИЗ
		|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
		|ГДЕ
		|	ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И &ОтборУдаленных
		|	И &ОтборПользователей";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Если ЗначениеПометкаУдаления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУдаленных", "ИСТИНА");
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборУдаленных", "ПрохождениеПрограммыОбученияСУО.ПометкаУдаления = &ЗначениеПометкаУдаления");
		Запрос.Параметры.Вставить("ЗначениеПометкаУдаления", ЗначениеПометкаУдаления);
	КонецЕсли;
	
	Если МассивПользователей = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "ИСТИНА");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПользователей", "ПрохождениеПрограммыОбученияСУО.Пользователь В (&МассивПользователей)");
		Запрос.Параметры.Вставить("МассивПользователей", МассивПользователей);
	КонецЕсли;	
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция КоличествоУчастниковПрограммыОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(УчастникиПрограммОбученияСУО.Пользователь) КАК КоличествоПользователей
		|ИЗ
		|	РегистрСведений.УчастникиПрограммОбученияСУО КАК УчастникиПрограммОбученияСУО
		|ГДЕ
		|	УчастникиПрограммОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.КоличествоПользователей;
	
КонецФункции

Функция ПрохождениеПрограммыОбучения(ПроведениеПрограммыОбучения, Пользователь) Экспорт

	// Важно! Информация о прохождении берется именно из списка
	// Документов "ПрохождениеПрограммыОбученияСУО", а не из регистров.
	// То есть функция возвращает любое прохождение, даже помеченное на удаление.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Прохождение
		|ИЗ
		|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
		|ГДЕ
		|	ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПрохождениеПрограммыОбученияСУО.Пользователь = &Пользователь
		|	И ПрохождениеПрограммыОбученияСУО.Отменено = ЛОЖЬ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Прохождение;
		
	КонецЕсли;
		
КонецФункции

Функция ВозможныеУчастникиПрограммыОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПроведениеПрограммыОбучения.ОткрытоДляРуководителей Тогда
		
		Если ПроведениеПрограммыОбучения.ОткрытоДляВсех Тогда

			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь КАК Пользователь
				|ИЗ
				|	РегистрСведений.РуководителиСУО КАК РуководителиСУО";

		Иначе
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.УчебныеГруппы КАК ПроведениеПрограммыОбученияСУОУчебныеГруппы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеПрограммыОбученияСУОУчебныеГруппы.УчебнаяГруппа = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка = &ПроведениеПрограммыОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.Организации КАК ПроведениеПрограммыОбученияСУООрганизации
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеПрограммыОбученияСУООрганизации.Организация = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУООрганизации.Ссылка = &ПроведениеПрограммыОбучения
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	РуководителиСУО.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.ПодразделенияПредприятия КАК ПроведениеПрограммыОбученияСУОПодразделенияПредприятия
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РуководителиСУО КАК РуководителиСУО
				|		ПО ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.ПодразделениеПредприятия = РуководителиСУО.ОбъектРуководства
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУОПодразделенияПредприятия.Ссылка = &ПроведениеПрограммыОбучения";
				
			Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
				
		КонецЕсли;
		
	Иначе
		
		Если ПроведениеПрограммыОбучения.ОткрытоДляВсех Тогда

			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Пользователи.Ссылка КАК Пользователь
				|ИЗ
				|	Справочник.Пользователи КАК Пользователи
				|ГДЕ
				|	Пользователи.ПометкаУдаления = ЛОЖЬ";

		Иначе
			
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	УчебныеГруппыСУОСостав.Пользователь
				|ИЗ
				|	Документ.ПроведениеПрограммыОбученияСУО.УчебныеГруппы КАК ПроведениеПрограммыОбученияСУОУчебныеГруппы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчебныеГруппыСУО.Состав КАК УчебныеГруппыСУОСостав
				|		ПО ПроведениеПрограммыОбученияСУОУчебныеГруппы.УчебнаяГруппа = УчебныеГруппыСУОСостав.Ссылка
				|ГДЕ
				|	ПроведениеПрограммыОбученияСУОУчебныеГруппы.Ссылка = &ПроведениеПрограммыОбучения";
				
			Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
				
		КонецЕсли;
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция ЕстьОтмененныеПрохождения(ПроведениеПрограммыОбучения, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрохождениеПрограммыОбученияСУО.Ссылка КАК Прохождение
		|ИЗ
		|	Документ.ПрохождениеПрограммыОбученияСУО КАК ПрохождениеПрограммыОбученияСУО
		|ГДЕ
		|	ПрохождениеПрограммыОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПрохождениеПрограммыОбученияСУО.Пользователь = &Пользователь
		|	И ПрохождениеПрограммыОбученияСУО.Отменено = ИСТИНА";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	Возврат НЕ Результат.Пустой();
		
КонецФункции

// СВОЙСТВА

Функция СценарийОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПрограммыОбучения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ПроведениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "Ссылка, ПрограммаОбучения, БезСценария");
	Иначе
		ПроведениеПрограммыОбученияСвойства = ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если ПроведениеПрограммыОбученияСвойства.БезСценария Тогда
		Возврат ПроведениеПрограммыОбученияСвойства.Ссылка;
	КонецЕсли;
	
	Возврат ПроведениеПрограммыОбученияСвойства.ПрограммаОбучения;
	
КонецФункции

Функция ШкалаОценки(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПрограммыОбучения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ПроведениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "БезСценария, ПрограммаОбучения");
	Иначе
		ПроведениеПрограммыОбученияСвойства = ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если ПроведениеПрограммыОбученияСвойства.БезСценария Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбученияСвойства.ПрограммаОбучения, "ШкалаОценки");
	Иначе
		Возврат Справочники.ШкалыОценокСУО.ШкалаОценокПоУмолчанию();
	КонецЕсли;
	
КонецФункции

Функция ПрограммаОбучения(Знач ПроведениеПрограммыОбучения) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбучения, "ПрограммаОбучения");
КонецФункции

Функция Наименование(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Если ТипЗнч(ПроведениеПрограммыОбучения) = Тип("ДокументСсылка.ПроведениеПрограммыОбученияСУО") Тогда
		ПроведениеПрограммыОбученияСвойства = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "БезСценария, ПрограммаОбучения, Наименование");
	Иначе
		ПроведениеПрограммыОбученияСвойства = ПроведениеПрограммыОбучения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПроведениеПрограммыОбученияСвойства.Наименование)
		ИЛИ ПроведениеПрограммыОбученияСвойства.БезСценария Тогда
		Возврат ПроведениеПрограммыОбученияСвойства.Наименование;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбученияСвойства.ПрограммаОбучения, "Наименование");
	КонецЕсли;		
	
КонецФункции

// ПРОВЕДЕНИЕ ОБУЧЕНИЯ

Процедура ЗаполнитьПрохожденияПодчиненныхМероприятий(ПроведениеПрограммыОбучения) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ПроведениеПрограммыОбучения) Тогда
		Текст = НСтр("ru = 'Параметр ""Проведение программы обучения"" не заполнен'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);			
		Возврат;
	КонецЕсли;
	
	ПрограммаОбучения = ПроведениеПрограммыОбучения.ПрограммаОбучения;
	
	Если НЕ ЗначениеЗаполнено(ПрограммаОбучения) Тогда
		Текст = НСтр("ru = 'Укажите программу обучения'");
		Поле = "ПрограммаОбучения";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,Поле);			
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеПрограммыОбученияСУО.Мероприятие
		|ИЗ
		|	Справочник.СодержаниеПрограммыОбученияСУО КАК СодержаниеПрограммыОбученияСУО
		|ГДЕ
		|	СодержаниеПрограммыОбученияСУО.Владелец = &ПрограммаОбучения
		|	И СодержаниеПрограммыОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И СодержаниеПрограммыОбученияСУО.ЭтоГруппа = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СодержаниеПрограммыОбученияСУО.РеквизитДопУпорядочивания";

	Запрос.УстановитьПараметр("ПрограммаОбучения", ПрограммаОбучения);

	Результат = Запрос.Выполнить();

	ТаблицаМероприятий = Результат.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.Мероприятие
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Результат = Запрос.Выполнить();

	ТаблицаПроведенийМероприятий = Результат.Выгрузить();
	
	НачатьТранзакцию();
	
	Для каждого Строка Из ТаблицаМероприятий Цикл
		
		ПроведениеОбучения = ТаблицаПроведенийМероприятий.Найти(Строка.Мероприятие, "Мероприятие");
		
		Если ПроведениеОбучения = Неопределено Тогда // Пропускаем уже созданные ранее Проведения обучения
			
			ПроведениеОбученияОбъект = Документы.ПроведениеОбученияСУО.СоздатьДокумент();
			ПроведениеОбученияОбъект.Дата = ТекущаяДата();
			ПроведениеОбученияОбъект.ПроведениеПрограммыОбучения = ПроведениеПрограммыОбучения;
			ПроведениеОбученияОбъект.Мероприятие = Строка.Мероприятие;
			ПроведениеОбученияОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		КонецЕсли;
	
	КонецЦикла;

	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Функция ПроведенияОбучения(ПроведениеПрограммыОбучения, Знач ВключатьПомеченныеНаУдаление = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.Ссылка КАК Ссылка,
		|	ПроведениеОбученияСУО.Мероприятие КАК Мероприятие,
		|	ПроведениеОбученияСУО.ОткрытоеМероприятие КАК ОткрытоДляЗаписи,
		|	ПроведениеОбученияСУО.АвтозачислениеНаОбучение КАК Автозачисление,
		|	ПроведениеОбученияСУО.БезСценария КАК БезСценария,
		|	ПроведениеОбученияСУО.НаОсновеМероприятия КАК НаОсновеМероприятия,
		|	ПроведениеОбученияСУО.НаОсновеЭлектронногоРесурса КАК НаОсновеЭлектронногоРесурса,
		|	ПроведениеОбученияСУО.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|	ПроведениеОбученияСУО.Проведен КАК Проведен,
		|	ПроведениеОбученияСУО.Дата КАК Дата,
		|	ПроведениеОбученияСУО.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ПроведениеОбученияСУО.АктивироватьАвтоматически КАК АктивироватьАвтоматически,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 1
		|			ТОГДА ПроведениеОбученияСУО.ДатаНачалаПроведения
		|		ИНАЧЕ ПроведениеОбученияСУО.ДатаНачалаДоступа
		|	КОНЕЦ КАК ДатаНачалаОбучения,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 0
		|					ИЛИ МИНУТА(ПроведениеОбученияСУО.ДатаНачалаПроведения) > 0)
		|			ТОГДА ПроведениеОбученияСУО.ДатаНачалаПроведения
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаНачалаДоступа) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаНачалаДоступа) > 0
		|					ИЛИ МИНУТА(ПроведениеОбученияСУО.ДатаНачалаДоступа) > 0)
		|			ТОГДА ПроведениеОбученияСУО.ДатаНачалаДоступа
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяНачалаОбучения,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаОкончанияПроведения) > 1
		|			ТОГДА ПроведениеОбученияСУО.ДатаОкончанияПроведения
		|		ИНАЧЕ ПроведениеОбученияСУО.ДатаКонтроля
		|	КОНЕЦ КАК ДатаОкончанияОбучения,
		|	ВЫБОР
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаОкончанияПроведения) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаОкончанияПроведения) <> 23
		|					И МИНУТА(ПроведениеОбученияСУО.ДатаОкончанияПроведения) <> 59)
		|			ТОГДА ПроведениеОбученияСУО.ДатаОкончанияПроведения
		|		КОГДА ГОД(ПроведениеОбученияСУО.ДатаКонтроля) > 1
		|				И (ЧАС(ПроведениеОбученияСУО.ДатаКонтроля) <> 23
		|					И МИНУТА(ПроведениеОбученияСУО.ДатаКонтроля) <> 59)
		|			ТОГДА ПроведениеОбученияСУО.ДатаКонтроля
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ВремяОкончанияОбучения,
		|	ВЫБОР
		|		КОГДА ПроведениеОбученияСУО.Наименование <> """"
		|			ТОГДА ПроведениеОбученияСУО.Наименование
		|		КОГДА ПроведениеОбученияСУО.НаОсновеЭлектронногоРесурса
		|			ТОГДА ПроведениеОбученияСУО.ЭлектронныйРесурс
		|		КОГДА ПроведениеОбученияСУО.НаОсновеМероприятия
		|			ТОГДА ПроведениеОбученияСУО.Мероприятие
		|		ИНАЧЕ ""Обучение""
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА ПроведениеОбученияСУО.НаОсновеМероприятия
		|			ТОГДА ПроведениеОбученияСУО.Мероприятие.Вид
		|		ИНАЧЕ ПроведениеОбученияСУО.ВидОбучения
		|	КОНЕЦ КАК Вид,
		|	ПроведениеОбученияСУО.Статус КАК Статус,
		|	ПроведениеОбученияСУО.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	&ОтборПометкаУдаления
		|	И ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомер,
		|	Дата";

	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Если ВключатьПомеченныеНаУдаление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПометкаУдаления", "ИСТИНА");
	Иначе		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПометкаУдаления", "ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ");
	КонецЕсли;
	
	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция Пустая(ПроведениеПрограммыОбучения, Знач ИсключитьОтмененныеИПомеченныеНаУдаление = Ложь) Экспорт

	Запрос = Новый Запрос;
	
	Если ИсключитьОтмененныеИПомеченныеНаУдаление Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПроведениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
			|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено";

		Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПроведениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения";
		
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);

	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

Функция ПоследнийПорядковыйНомер(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.ПорядковыйНомер КАК ПорядковыйНомер
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПорядковыйНомер УБЫВ";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 1;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.ПорядковыйНомер;
	
КонецФункции

Функция ПолучитьПродолжительностьПрограммыОбучения(ПроведениеПрограммыОбучения) Экспорт
	
	ОбщаяПродолжительность = 0;
	
	ТаблицаМероприятий = ПроведенияОбучения(ПроведениеПрограммыОбучения);
	
	Для каждого Строка Из ТаблицаМероприятий Цикл
		ПродолжительностьОбучения = Документы.ПроведениеОбученияСУО.Продолжительность(Строка.ПроведениеОбучения); 	
		ОбщаяПродолжительность = ОбщаяПродолжительность + ПродолжительностьОбучения;
	КонецЦикла;
	
	Возврат ОбщаяПродолжительность;
	
КонецФункции

Функция ПервоеПроведенияОбучения(Знач ПроведениеПрограммыОбучения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.ДатаНачалаПроведения КАК ДатаНачала,
		|	ПроведениеОбученияСУО.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПроведениеОбученияСУО.ВариантПродолжительности = &ВариантПродолжительности
		|	И ПроведениеОбученияСУО.ДатаНачалаПроведения <> &ПустаяДата
		|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ТаблицаОбучений = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения,
		|	ПроведениеОбученияСУО.ДатаНачалаДоступа КАК ДатаНачала,
		|	ПроведениеОбученияСУО.СкрытьВремяПроведения КАК СкрытьВремя
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПроведениеОбученияСУО.ВариантПродолжительности = &ВариантПродолжительности
		|	И ПроведениеОбученияСУО.ДатаНачалаДоступа <> &ПустаяДата
		|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	Запрос.УстановитьПараметр("ПустаяДата", Дата("00010101"));
	Запрос.УстановитьПараметр("ВариантПродолжительности", Перечисления.ПродолжительностьОбученияСУО.Фиксированная);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаОбучений);
	
	Если ТаблицаОбучений.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаОбучений.Сортировать("ДатаНачала");
	
	РезультатСтруктура = УправлениеОбучениемСУО.ПервоеПроведенияОбученияПустаяСтруктура();
	РезультатСтруктура.Вставить("ПроведениеОбучения", ТаблицаОбучений[0].ПроведениеОбучения);
	РезультатСтруктура.Вставить("ДатаНачала", ТаблицаОбучений[0].ДатаНачала);
	РезультатСтруктура.Вставить("СкрытьВремя", ТаблицаОбучений[0].СкрытьВремя);
	
	Возврат РезультатСтруктура;
	
КонецФункции

// ПРЕПОДАВАТЕЛИ

Функция Преподаватели(Знач ПроведениеПрограммыОбучения) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроведениеОбученияСУО.Ссылка КАК ПроведениеОбучения
		|ПОМЕСТИТЬ ПроведенияОбученияПрограммы
		|ИЗ
		|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
		|ГДЕ
		|	ПроведениеОбученияСУО.ПроведениеПрограммыОбучения = &ПроведениеПрограммыОбучения
		|	И ПроведениеОбученияСУО.Статус <> &СтатусОтменено
		|	И ПроведениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроведениеПреподавателемОбученияСУО.Пользователь КАК Пользователь
		|ИЗ
		|	Документ.ПроведениеПреподавателемОбученияСУО КАК ПроведениеПреподавателемОбученияСУО
		|ГДЕ
		|	ПроведениеПреподавателемОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПроведениеПреподавателемОбученияСУО.ПроведениеОбучения В
		|			(ВЫБРАТЬ
		|				ПроведенияОбученияПрограммы.ПроведениеОбучения
		|			ИЗ
		|				ПроведенияОбученияПрограммы)";
	
	Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
	Запрос.УстановитьПараметр("СтатусОтменено", Перечисления.СтатусыПроведенияОбъектовСУО.Отменено);
	 
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Пользователь");
	
КонецФункции

// ДОПОЛНИТЕЛЬНО

Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

  Результат = Новый Массив;

  Результат.Добавить("ПрограммаОбучения");

  Возврат Результат;

КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ПрограммаОбучения");
	Поля.Добавить("БезСценария");
	Поля.Добавить("Наименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтандартнаяОбработка = Ложь;
	
	НаименованиеСценария = "";
	
	Если Данные.БезСценария Тогда
		НаименованиеСценария = Данные.Наименование;
	Иначе
		НаименованиеСценария = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ПрограммаОбучения, "Наименование");
	КонецЕсли;
	
	Представление = НаименованиеСценария;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Ключ") Тогда
			Возврат;
		КонецЕсли;
		
		Если Параметры.Свойство("ЗначениеКопирования") Тогда
			Возврат;
		КонецЕсли;			
		
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКаталогОбученийСУО") Тогда
			// Нельзя создавать программу по сценарию без расширенного режима
			Если НЕ Параметры.Свойство("ЗначенияЗаполнения") Тогда
				Параметры.Вставить("ЗначенияЗаполнения", Новый Структура);				
			КонецЕсли;
			Параметры.ЗначенияЗаполнения.Вставить("БезСценария", Истина);
			Параметры.ЗначенияЗаполнения.Вставить("ПрограммаОбучения", Неопределено);
			ПоказатьФормуСоздания = Ложь;
		КонецЕсли;		
		
		ПоказатьФормуСоздания = Истина;
		
		Если Параметры.Свойство("ЗначенияЗаполнения")
			И (Параметры.ЗначенияЗаполнения.Свойство("БезСценария")
			ИЛИ Параметры.ЗначенияЗаполнения.Свойство("ПрограммаОбучения")) Тогда
			
			ПоказатьФормуСоздания = Ложь;
			
		КонецЕсли;
		
		Если Параметры.Свойство("Основание") Тогда
			ПоказатьФормуСоздания = Ложь;
		КонецЕсли;
		
		
		Если ПоказатьФормуСоздания Тогда			
			СтандартнаяОбработка = Ложь;			
			ВыбраннаяФорма = "ФормаСоздания";			
		КонецЕсли;		
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
